app/controllers/main_controller.rb

SELECT  "events".* FROM "events" ORDER BY "events"."updated_at" ASC LIMIT ?  [["LIMIT", 11]]
---
    def index

      @last_events = Event.all.order(updated_at: :asc)