app/controllers/meetup_controller.rb

  def show



    urlname    = params[:urlname]
    event_id   = params[:event_id]
    @selected_event = Meetup.new.selected_event(urlname, event_id)
    @event_members = Meetup.new.selected_event_rsvps(urlname, event_id)

    if @selected_event['featured_photo']
    new_event = Event.new(name: @selected_event['name'], photo: @selected_event['featured_photo']['photo_link'], urlname: urlname, event_id: event_id )
    else
    new_event = Event.new(name: @selected_event['name'], photo: 'http://www.bsmc.net.au/wp-content/uploads/No-image-available.jpg', urlname: urlname, event_id: event_id )
    end

    if new_event.save
      p 'event saved'
    else
      p 'event updated'
      new_event = Event.find_by(event_id: event_id)
      new_event.updated_at = Time.now
      new_event.save
---
SELECT  "events".* FROM "events" WHERE "events"."event_id" = $1 LIMIT $2  [["event_id", "253515454"], ["LIMIT", 1]]
INSERT INTO "events" ("name", "photo", "urlname", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "events".* FROM "events" WHERE "events"."event_id" = $1 LIMIT $2  [["event_id", "253252881"], ["LIMIT", 1]]
UPDATE "events" SET "updated_at" = $1 WHERE "events"."id" = $2  [["updated_at", "2018-08-09 23:29:47.501041"], ["id", 7]]
UPDATE "events" SET "updated_at" = $1 WHERE "events"."id" = $2  [["updated_at", "2018-08-10 00:06:34.269574"], ["id", 6]]